Repository: google/blockly
Catalog: demos/plane/xlf/translated_msgs_*.xlf
Languages: ms

source: Rows: %1
ms: Baris: %1

source: seats =
ms: tempat duduk =

source: An airplane has two seats in the flight deck (for the pilot and co-pilot), and a number of rows of 1st class and 2nd class passenger seats. Each 1st class row contains four seats. Each 2nd class row contains five seats.
ms: Sebuah kapal terbang mempunyai tempat duduk di kokpit (untuk juruterbang dan pembantunya) dan sebilangan baris tempat duduk penumpang kelas pertama dan kelas kedua. Setiap baris kelas pertama mengandungi empat tempat duduk. Setiap baris kelas pertama mengandungi lima tempat duduk.

source: Build a formula (below) that calculates the total number of seats on the airplane as the rows are changed (above).
ms: Wujudkan formula (di bawah) yang mengira jumlah tempat duduk di dalam kapal terbang sedangkan baris-barisnya diubah (di atas).

source: An airplane has two seats in the flight deck (for the pilot and co-pilot), and a number of rows of passenger seats. Each row contains four seats.
ms: Sebuah kapal terbang mempunyai tempat duduk di kokpit (untuk juruterbang dan pembantunya) dan sebilangan baris tempat duduk penumpang. Setiap baris mengandungi empat tempat duduk.

source: 1st class rows (%1)
ms: baris kelas pertama (%1)

source: 2nd class rows: %1
ms: Baris kelas kedua: %1

source: Seats: %1
ms: Tempat duduk: %1

source: Plane Seat Calculator
ms: Pengira Tempat Duduk Kapal Terbang

source: rows (%1)
ms: baris (%1)

source: 1st class rows: %1
ms: Baris kelas pertama: %1

source: An airplane has a number of rows of passenger seats. Each row contains four seats.
ms: Sebuah kapal terbang mempunyai sebilangan baris tempat duduk penumpang. Setiap baris mengandungi empat tempat duduk.

source: 2nd class rows (%1)
ms: baris kelas kedua (%1)
