{
	"Apps.subtitle": "A short description of Blockly.",
	"Apps.blocklyMessage": "The project name.  If readers of your language would know approximately how to pronounce 'Blockly', leave unchanged.  Otherwise, include a transliteration in parentheses, such as the Russian: 'Blockly (Блoкли)'.",
	"Apps.codeTooltip": "tooltip - Pressing the button causes a program in the JavaScript computer language to be displayed, based on the program created by the user.",
	"Apps.linkTooltip": "tooltip - Clicking on this button will cause the current program to be saved and for a URL to be shown to later retrieve it.",
	"Apps.runTooltip": "tooltip - Pressing this button runs the computer program the user has written.",
	"Apps.runProgram": "button label - Pressing the button runs the computer program the user has written.",
	"Apps.resetProgram": "button label - Pressing the button causes the output of the program to be erased but does not delete the user's program).",
	"Apps.dialogOk": "Label on button for user to press when done reading help information.\n{{Identical|OK}}",
	"Apps.dialogCancel": "Label on button for user to press when not wanting to proceed.\n{{Identical|Cancel}}",
	"Apps.catLogic": "category - Blocks related to [https://code.google.com/p/blockly/wiki/Logic logic].",
	"Apps.catLoops": "category - Blocks related to [https://en.wikipedia.org/wiki/Control_flow#Loops loops].",
	"Apps.catMath": "category - Blocks related to mathematics.",
	"Apps.catText": "category - Blocks related to [https://code.google.com/p/blockly/wiki/Text text processing].\n{{Identical|Text}}",
	"Apps.catLists": "category - Blocks related to [https://code.google.com/p/blockly/wiki/Lists lists].\n{{Identical|Lists}}",
	"Apps.catColour": "category - Blocks related to [https://code.google.com/p/blockly/wiki/Colour colour].\n{{Identical|Colour}}",
	"Apps.catVariables": "category - Blocks related to [https://code.google.com/p/blockly/wiki/Variables variables].",
	"Apps.catProcedures": "category - Blocks related to [https://en.wikipedia.org/wiki/Subroutine defining or using procedures/functions].",
	"Apps.httpRequestError": "alert - The URL is invalid or a server error occurred.  This message will be followed by technical information useful to engineers trying to understand the problem.",
	"Apps.linkAlert": "alert - After the user has pressed a button to save his/her program, this provides the URL (%1) to retrieve the program.  The characters '\n\n' indicate that a blank line will be displayed before the URL (in English).  Leave those in unless you move %1 to the beginning or middle of the text, in which case you should use your judgment about where blank lines would be most useful.\n\nParameters:\n* %1 - URL of saved program.",
	"Apps.hashError": "alert - A request to retrieve a stored program does not have a valid URL. %1 is the invalid portion of the URL.",
	"Apps.xmlError": "alert - There was a problem loading a file previously saved by the user.  The most likely reason for the problem is that it was created with an earlier, incompatible version of Blockly.  This message will be followed by technical information useful to engineers trying to understand the problem.",
	"Apps.listVariable": "variable name - Default [https://code.google.com/p/blockly/wiki/Variables variable] representing a [https://code.google.com/p/blockly/wiki/Lists list].  This should be a single word, preferably short.",
	"Apps.textVariable": "variable name - Default [https://code.google.com/p/blockly/wiki/Variables variable] representing a [https://code.google.com/p/blockly/wiki/Text piece of text].  This should be a single word, preferably short.\n{{Identical|Text}}",
	"Code.badXml": "alert - Message shown when the user tries switching from the XML tab after entering XML text that could not be parsed.  This asks whether they wish to abandon the XML they added.  If they select 'OK' (or the translated equivalent), the XML is cleared, and the other tab is shown.  If they select 'Cancel', they remain on the XML tab with the bad XML.\n\nUsed in JavaScript <code>window.confirm()</code>.",
	"Code.badCode": "alert - Message shown if an error occurs while interpreting the user program.  The error description follows.",
	"Code.timeout": "alert - Message shown if the program has run for more than the permitted number of steps.  This exists so that programs with infinite loops do not run forever.",
	"Code.discard": "alert - Message shown after the user clicks on the 'discard all' icon.  Selecting 'OK' (or the translated equivalent) causes all of the blocks to be discarded.  Selecting 'Cancel' prevents blocks from being deleted.\n\nParameters:\n* %1 - number of blocks to be deleted. It is always an integer greater than or equal to 2.",
	"Code.title": "title - Title of this application, indicating that it is for writing arbitrary programs.\n{{Identical|Code}}",
	"Code.blocks": "tab text - Displays and allows editing of the user's program as blocks.\n{{Identical|Blocks}}",
	"Code.trashTooltip": "tooltip - Clicking on this causes the user program to be discarded.",
	"Graph.title": "title - Brief title for this graphic calculator application.",
	"Apps.indexTitle": "page text - The word 'Apps' is short for 'Applications'.  We chose it because it is more informal.  This and the following messages currently appear at [http://blockly-demo.appspot.com/static/apps/index.html].",
	"Apps.indexFooter": "page text - Text appearing at the end of the page. Parameters:\n* %1 - the Blockly URL",
	"Apps.choiceIntro": "page text - This appears before a list of Blockly apps. Please use the same term for 'Blockly' as in {{msg-blockly|Apps.blocklyMessage}}.",
	"Puzzle.title": "A brief title for page, not including the word for Blockly.  Use the word for a jigsaw puzzle.",
	"Apps.puzzleSubtitle": "page text - A subtitle describing Blockly's [https://blockly-demo.appspot.com/static/apps/puzzle/index.html Puzzle application].",
	"Maze.maze": "title - Specifies that this is Blockly's '''Maze''' tutorial.",
	"Apps.mazeSubtitle": "page text - A subtitle describing Blockly's [https://blockly-demo.appspot.com/static/apps/maze/index.html Maze application].",
	"Turtle.title": "title - Specifies that this is Blockly's '''Turtle Graphics''' application.  Should you wish to, you can read more about [https://en.wikipedia.org/wiki/Turtle_graphics turtle graphics].",
	"Apps.turtleSubtitle": "page text - A subtitle describing Blockly's [https://blockly-demo.appspot.com/static/apps/turtle/index.html Turtle application].",
	"Apps.graphSubtitle": "page text - A subtitle describing Blockly's [https://blockly-demo.appspot.com/static/apps/graph/index.html Graph application].",
	"Apps.codeSubtitle": "page text - A subtitle describing Blockly's [https://blockly-demo.appspot.com/static/apps/code/index.html Code application].",
	"Plane.plane": "title - Specifies that this is Blockly's '''Plane''' (airplane) tutorial.  The word 'plane' was chosen over 'airplane' in English because it is shorter and less formal.",
	"Apps.planeSubtitle": "page text - A subtitle describing Blockly's [https://blockly-demo.appspot.com/static/apps/plane/index.html Plane application].",
	"Apps.blockFactory": "title - The name of a factory or tool that produces blocks.",
	"Apps.blockfactorySubtitle": "page text - A subtitle describing Blockly's [https://blockly-demo.appspot.com/static/apps/blockfactory/index.html Block Factory application].",
	"Maze.moveForward": "block text - Imperative or infinitive of a verb for a person moving (walking) in the direction he/she is facing.",
	"Maze.turnLeft": "[[Translating:Blockly#Drop-Down_Menus dropdown]] - Imperative or infinitive of a verb for a person turning his head and body one quarter rotation counter-clockwise.  Prefer a translation that has text in common with the translation of 'turn right'.  See [[Translating:Blockly#Drop-Down_Menus]].",
	"Maze.turnRight": "[[Translating:Blockly#Drop-Down_Menus dropdown]] - Imperative or infinitive of a verb for a person turning his head and body one quarter rotation clockwise.  Prefer a translation that has text in common with the translation of 'turn left'.  See [[Translating:Blockly#Drop-Down_Menus]].",
	"Maze.doCode": "block text - Imperative or infinitive of a verb preceding one or more commands to a person.  This is part of [https://code.google.com/p/blockly/wiki/Loops#repeat repeat] and [https://code.google.com/p/blockly/wiki/IfElse#If_blocks if] blocks.",
	"Maze.elseCode": "block text - Conjunction meaning 'otherwise', introducing commands to be performed if a previous condition was not true, as in 'if x>3, do this, else do that'.  See [https://code.google.com/p/blockly/wiki/IfElse#If-Else_blocks].",
	"Maze.helpIfElse": "callout - This is shown when the 'if-else' block is introduced.  For 'if-else' concatenate the words for 'if' and 'else/otherwise'.",
	"Maze.pathAhead": "[[Translating:Blockly#Drop-Down_Menus dropdown]] - Condensed form of 'if there is a path ahead', as in: 'if path ahead, go forward'.  Prefer translation that has text in common with 'if path to the left' and 'if path to the right'.",
	"Maze.pathLeft": "[[Translating:Blockly#Drop-Down_Menus dropdown]] - Condensed form of 'if there is a path to the left', as in: 'if path to the left, turn left'.",
	"Maze.pathRight": "[[Translating:Blockly#Drop-Down_Menus dropdown]] - Condensed form of 'if there is a path to the right', as in: 'if path to the right, turn right'.",
	"Maze.repeatUntil": "block text - Imperative or infinitive of a verb to repeat the following commands.  The phrase is followed by the symbol denoting the end of the maze.\n\nSee also:\n* {{msg-blockly|Maze.helpRepeatMany}}.",
	"Maze.moveForwardTooltip": "tooltip - Moves the icon on the screen representing the player forward one square on the maze board.",
	"Maze.turnTooltip": "tooltip - Turns the icon on the screen representing the player 90 degrees counter-clockwise (left) or clockwise (right).",
	"Maze.ifTooltip": "tooltip - 'path' refers to a path through a maze.",
	"Maze.ifelseTooltip": "tooltip - 'path' refers to a path through a maze.",
	"Maze.whileTooltip": "tooltip - Repeat the enclosed commands until the maze has been successfully completed (the end point reached).",
	"Maze.capacity0": "warning - No more blocks may be added until some are removed.  Please include '%0' in the translated string.  It will be replaced with '0' and made bold.",
	"Maze.capacity1": "warning - Only one more block may be added.  Please include '%1' in the translated string. It will be replaced with '1' and made bold.\n\nSee also:\n* {{msg-blockly|Maze.capacity2}}",
	"Maze.capacity2": "warning - Only %2 more blocks may be used, where %2 is an integer greater than 1.\n\nSee also:\n* {{msg-blockly|Maze.capacity1}}",
	"Maze.nextLevel": "alert - This is displayed when the user solves the maze, inviting them to precede to the next level of difficulty.\n\nParameters:\n* %1 - the number of the next level, which is always an integer greater than 1.",
	"Maze.finalLevel": "alert - This is displayed when the user solves the most difficult level.",
	"Maze.runTooltip": "tooltip - Pressing this button runs the computer program the user has written to move the player through the maze.",
	"Maze.resetTooltip": "tooltip - Pressing this button restores the player to the start position and enables the user's program to be run again.",
	"Maze.helpStack": "callout - The words for 'stack' and 'blocks' should be the same as for stacking children's blocks. Use the imperative verb form appropriate for speaking to a child, gender unspecified.  If no gender-neutral singular/familiar form exists but a gender-neutral plural/formal form exists, use that instead.  Be sure to use the same translation of 'move forward' as above.\n\n'move forward' refers to {{msg-blockly|Maze.moveForward}}.",
	"Maze.helpOneTopBlock": "callout - This is displayed if a user attempts to run a program composed of multiple stacks of blocks, letting them know they need to create a single stack.",
	"Maze.helpRun": "callout - This is shown after the user has created a program on the first level.",
	"Maze.helpReset": "callout - This is shown after the user has run a program that does not solve the maze.\n\n'Reset' refers to {{msg-blockly|Apps.resetProgram}}.",
	"Maze.helpRepeat": "callout - This is shown when the 'repeat' block is introduced.  The word 'path' refers to a path through a maze, and 'block' refers to a child's building block.",
	"Maze.helpCapacity": "callout - This is shown after the user has used all the blocks permitted on this level.",
	"Maze.helpRepeatMany": "callout - This is a hint that the user should place a second block inside of a 'repeat' block.\n\n'repeat' should be consistent with {{msg-blockly|Maze.repeatUntil}}.",
	"Maze.helpSkins": "callout - This is a hint that the user can change the appearance of the player that moves within the maze.",
	"Maze.helpIf": "callout - This is shown when the 'if' block is introduced.  An example of an 'if' block is: 'if there is a path to the left, turn left'.",
	"Maze.helpMenu": "callout - %1 will be replaced with an image of the dropdown menu that the user needs to click.",
	"Maze.helpWallFollow": "callout - This advises the user to solve a maze by keeping his/her left hand in contact with the wall while proceding through it.  The final sentence is a warning that only advanced programmers should attempt this problem, as beginners tend to get frustrated.",
	"Plane.rows": "page text - Total number of rows of seats on an airplane.\n\nParameters:\n* %1 - number of rows of seats on an airplane.  It is always an integer greater than or equal to zero.",
	"Plane.getRows": "block text - The number of rows on the airplane, to be used in a mathematical equation, such as: 'seats = 4 x '''rows (5)''''.\n\nParameters:\n* %1 - number of rows of seats on an airplane.  It is always an integer greater than or equal to zero.",
	"Plane.rows1": "page text - The number of rows of first-class seats on the airplane.  You can see the block at [http://blockly-share.appspot.com/static/apps/plane/plane.html?lang=en&level=3].\n\nParameters:\n* %1 - number of rows of first-class seats on an airplane.  It is always an integer greater than or equal to zero.",
	"Plane.getRows1": "block text - The number of rows of first-class seats on the, to be used in a mathematical equation.  See [http://blockly-share.appspot.com/static/apps/plane/plane.html?lang=en&level=3].\n\nParameters:\n* %1 - number of rows of first-class seats on an airplane.  It is always an integer greater than or equal to zero.",
	"Plane.rows2": "page text - The number of rows of second-class seats on the airplane.  %1 is an integer greater or equal to zero.  See [http://blockly-share.appspot.com/static/apps/plane/plane.html?lang=en&level=3].\n\nParameters:\n* %1 - number of rows of second-class seats on an airplane.  It is always an integer greater than or equal to zero.",
	"Plane.getRows2": "block text - The number of rows of second-class (also called 'economy class') seats on the airplane, to be used in a mathematical expression.\n\nParameters:\n* %1 - number of rows of second-class seats on an airplane.  It is always an integer greater than or equal to zero.",
	"Plane.seats": "page text - The total number of seats on the airplane.\n\nParameters:\n* %1 - number of seats on an airplane.  It is always either the next message or an integer greater than or equal to zero.",
	"Plane.placeholder": "page text - A word or symbol indicating that this numeric value has not yet been determined.",
	"Plane.setSeats": "block text - The first half of a mathematical equation determining the number of seats in an airplane, such as: ''''seats =''' 4 x rows'.",
	"Plane.description1": "instructions - Note that in [http://blockly-share.appspot.com/static/apps/plane/plane.html?lang=en&level=1 this level], there is only one type of seat on the plane.",
	"Plane.description2": "instructions - Note that in [http://blockly-share.appspot.com/static/apps/plane/plane.html?lang=en&level=2 this level], there are two types of seats on this plane.",
	"Plane.description3": "instructions - Note that in [http://blockly-share.appspot.com/static/apps/plane/plane.html?lang=en&level=3 this level], there are three types of seats on this plane.  Be sure to use the same terms for '1st class' and '2nd class' as you did for the earlier messages.",
	"Plane.instructions": "page text - This text appears below the airplane graphic and above the space for the user to create the formula.  The number of rows an the graphic may be changed by the user with a slider.  See [http://blockly-share.appspot.com/static/apps/plane/plane.html?lang=en&level=1] for a picture.",
	"Puzzle.country1": "The name of the country Australia\n{{Identical|Australia}}",
	"Puzzle.country1Language": "The English language.{{Identical|English}}",
	"Puzzle.country1City1": "The city Melbourne in Australia.",
	"Puzzle.country1City2": "The city Sydney in Australia.",
	"Puzzle.country1HelpUrl": "The URL of a page with basic information about Australia.",
	"Puzzle.country2": "The country Germany.\n{{Identical|Germany}}",
	"Puzzle.country2Language": "The German language.\n{{Identical|German}}",
	"Puzzle.country2City1": "The city Berlin in Germany.",
	"Puzzle.country2City2": "The city Munich (München) in Germany.",
	"Puzzle.country2HelpUrl": "The URL of a page with basic information about Germany.",
	"Puzzle.country3": "The People's Republic of China.",
	"Puzzle.country3Language": "The Chinese language.\n{{Identical|Chinese}}",
	"Puzzle.country3City1": "The capital city of China (also known as Peking).",
	"Puzzle.country3City2": "The city Shanghai in China.",
	"Puzzle.country3HelpUrl": "The URL of a page with basic information about China.",
	"Puzzle.country4": "The name of the country Brazil.",
	"Puzzle.country4Language": "The Portuguese language.\n{{Identical|Portuguese}}",
	"Puzzle.country4City1": "The city Rio de Janeiro in Brazil.",
	"Puzzle.country4City2": "The city São Paulo in Brazil.",
	"Puzzle.country4HelpUrl": "The URL of a page with basic information about Brazil.",
	"Puzzle.flag": "[[File:Config-language.png|left||32px]]\nnoun the official flag representing a country (the national flag).\n{{Identical|Flag}}",
	"Puzzle.language": "Prompt for the user to provide the official language of a country.\n{{Identical|Language}}",
	"Puzzle.languageChoose": "Initial text displayed in a dropdown menu from which the user should choose the language spoken in the indicated country.\n{{Identical|Choose}}",
	"Puzzle.cities": "A label preceding a list of cities.\n{{Identical|City}}",
	"Puzzle.error0": "A congratulatory message displayed if the user placed all of the blocks correctly.\n\nParameters:\n* %1 - number of blocks correctly placed.  It is always an integer greater than 1.\n\nThe use of a new line character is optional.",
	"Puzzle.error1": "An encouraging error message displayed if the user placed all blocks except 1 correctly.\n\nIf the number of incorrect blocks is 2 or more, Puzzle.error2 is used instead.",
	"Puzzle.error2": "An error message displayed if the user misplaced multiple blocks.\n\nParameters:\n* %1 - number of blocks incorrectly placed, which is always greater than 1 (or the message Puzzle.error1 would be used).",
	"Puzzle.tryAgain": "A message indicating that a visually distinguished block is incorrect and that the user should try to fix it.\n\nThe use of a new line character is optional.",
	"Puzzle.help": "The label on a button the user can press for help.\n{{Identical|Help}}",
	"Puzzle.checkAnswers": "A label on a button the user can press to check his/her answers.",
	"Puzzle.helpText": "Instructions for the puzzle.  For context, see [http://blockly-demo.appspot.com/static/apps/puzzle/index.html Blockly Puzzle].",
	"Turtle.moveTooltip": "tooltip - In this and subsequent messages, 'turtle' refers to a stylized turtle on the screen to represent a position and direction.  This imaginary turtle is carrying a pen in its tail, so moving the turtle draws a line (or curve, etc.).  You are encouraged to play with the [https://blockly-demo.appspot.com/static/apps/turtle/index.html Turtle application] before doing this translation.",
	"Turtle.moveForward": "[[Translating:Blockly#Drop-Down_Menus dropdown]] - Infinitive or imperative of a verb telling a turtle to move (walk) in the direction he/she is facing.  This is followed by a number indicating how far (how many pixels) to go.  Prefer a translation that has text in common with the translation of 'move backward'.  See [[Translating:Blockly#Drop-Down_Menus]].",
	"Turtle.moveBackward": "[[Translating:Blockly#Drop-Down_Menus dropdown]] - Infinitive or imperative of a verb telling a turtle to move (walk) in the direction opposite to where he/she is facing.  This is followed by a number indicating how far (how many pixels) to go.  Prefer a translation that has text in common with the translation of 'move forward'.",
	"Turtle.turnTooltip": "'Left' means counter-clockwise/anti-clockwise, and 'right' means clockwise.",
	"Turtle.turnRight": "[[Translating:Blockly#Drop-Down_Menus dropdown]] - Infinitive or imperative of verb telling a turtle to rotate clockwise.  This is followed by a number indicating how far (how many degrees) to turn.  Prefer a translation that has text in common with the translation of 'turn left by'.",
	"Turtle.turnLeft": "[[Translating:Blockly#Drop-Down_Menus dropdown]] - Infinitive or imperative of verb telling a turtle to rotate counter-clockwise (anti-clockwise).  This is followed by a number indicating how far (how many degrees) to turn.  Prefer a translation that has text in common with the translation of 'turn right by'.",
	"Turtle.widthTooltip": "tooltip",
	"Turtle.setWidth": "block text - Infinitive or imperative of a verb to set the width of the lines that should be drawn in the future by an imaginary pen.  This is followed by a number indicating the width in pixels (1 or greater).",
	"Turtle.colourTooltip": "tooltip - Changes the colour of ink in the pen carried by the turtle.",
	"Turtle.setColour": "block text - Infinitive or imperative of a verb to specify the colour of the lines that should be drawn in the future by an imaginary pen.  This is followed by a block showing the colour",
	"Turtle.penTooltip": "tooltip - Lifting the pen off the writing surface prevents anything from being drawn.  Lowering it (after it has been lifted) enables it to draw again.",
	"Turtle.penUp": "block text - Infinitive or imperative of a verb to lift up a pen so that moving it leaves no mark on the writing surface.",
	"Turtle.penDown": "block text - Infinitive or imperative of a verb to lower a raised pen so that moving it leaves a mark on the writing surface.",
	"Turtle.turtleVisibilityTooltip": "tooltip",
	"Turtle.hideTurtle": "block text - Infinitive or imperative of a verb telling a turtle to hide itself (become invisible).",
	"Turtle.showTurtle": "block text - Infinitive or imperative of a verb telling a turtle to show itself (become visible after having been invisible).",
	"Turtle.printHelpUrl": "URL - Information about printing or typography.",
	"Turtle.printTooltip": "tooltip - Note that 'print' refers to displaying text on the screen, not on an external printer.",
	"Turtle.print": "block text - Infinitive or imperative of a verb telling a turtle to display text on the screen.  This is always followed by a block indicating what should be printed.",
	"Turtle.fontHelpUrl": "URL - Information about typographic fonts.",
	"Turtle.fontTooltip": "tooltip - This is shown on the block that lets the user specify the font [family], size, and style that should be used for subsequent displays of text.",
	"Turtle.font": "block text - This precedes a dropdown menu specifying the typographic font [family] that should be used when displaying text.",
	"Turtle.fontSize": "block text - This precedes a number specifying the size of the typographic font that should be used when displaying text.  This appears in the same block as 'font', so that word should not be repeated.",
	"Turtle.fontNormal": "[[Translating:Blockly#Drop-Down_Menus dropdown]] - Specifies that a typographic font should be normal (neither in italics or bold).",
	"Turtle.fontBold": "[[Translating:Blockly#Drop-Down_Menus dropdown]] - Specifies that a typographic font should be [https://en.wikipedia.org/wiki/Emphasis_(typography) bold].",
	"Turtle.fontItalic": "[[Translating:Blockly#Drop-Down_Menus dropdown]] - Specifies that a typographic font should be [https://en.wikipedia.org/wiki/Italics italic].",
	"Turtle.unloadWarning": "alert - This is shown if the user attempts to close the browser tab containing the page or navigate to a different page to prevent them from accidentally losing their program in progress.",
	"Turtle.runTooltip": "tooltip - Pressing this button runs the computer program the user has written to move the turtle on the canvas.",
	"Turtle.captureTooltip": "tooltip - Pressing this button causes the drawing created by the user's program to be saved as an image on the user's computer.  The button icon looks like a camera.",
	"Turtle.imgFilename": "filename - The name of the image file containing the user's drawing.  It must end with '.png'.",
	"Turtle.catTurtle": "category - Blocks related to Turtle commands."
}
