{
	"Apps.subtitle": "A short description of Blockly.",
	"Blockly": "The project name.  If readers of your language would know approximately how to pronounce 'Blockly', leave unchanged.  Otherwise, include a transliteration in parentheses, such as the Russian: 'Blockly (Блoкли)'.",
	"Apps.codeTooltip": "tooltip - Pressing the button causes a program in the JavaScript computer language to be displayed, based on the program created by the user.",
	"Apps.linkTooltip": "tooltip - Clicking on this button will cause the current program to be saved and for a URL to be shown to later retrieve it.",
	"Apps.runTooltip": "tooltip - Pressing this button runs the computer program the user has written.",
	"Apps.runProgram": "button label - Pressing the button runs the computer program the user has written.",
	"Apps.resetProgram": "button label - Pressing the button causes the output of the program to be erased but does not delete the user's program).",
	"Apps.dialogOk": "Label on button for user to press when done reading help information.\n{{Identical|OK}}",
	"Apps.dialogCancel": "Label on button for user to press when not wanting to proceed.\n{{Identical|Cancel}}",
	"Apps.catLogic": "category - Blocks related to [https://github.com/google/blockly/wiki/Logic logic].",
	"Apps.catLoops": "category - Blocks related to [https://en.wikipedia.org/wiki/Control_flow#Loops loops].",
	"Apps.catMath": "category - Blocks related to mathematics.",
	"Apps.catText": "category - Blocks related to [https://github.com/google/blockly/wiki/Text text processing].\n{{Identical|Text}}",
	"Apps.catLists": "category - Blocks related to [https://github.com/google/blockly/wiki/Lists lists].\n{{Identical|Lists}}",
	"Apps.catColour": "category - Blocks related to [https://github.com/google/blockly/wiki/Colour colour].\n{{Identical|Colour}}",
	"Apps.catVariables": "category - Blocks related to [https://github.com/google/blockly/wiki/Variables variables].",
	"Apps.catProcedures": "category - Blocks related to [https://en.wikipedia.org/wiki/Subroutine defining or using procedures/functions].",
	"Apps.httpRequestError": "alert - The URL is invalid or a server error occurred.  This message will be followed by technical information useful to engineers trying to understand the problem.",
	"Apps.linkAlert": "alert - After the user has pressed a button to save his/her program, this provides the URL (%1) to retrieve the program.  The characters '\n\n' indicate that a blank line will be displayed before the URL (in English).  Leave those in unless you move %1 to the beginning or middle of the text, in which case you should use your judgment about where blank lines would be most useful.\n\nParameters:\n* %1 - URL of saved program.",
	"Apps.hashError": "alert - A request to retrieve a stored program does not have a valid URL. %1 is the invalid portion of the URL.",
	"Apps.xmlError": "alert - There was a problem loading a file previously saved by the user.  The most likely reason for the problem is that it was created with an earlier, incompatible version of Blockly.  This message will be followed by technical information useful to engineers trying to understand the problem.",
	"Apps.listVariable": "variable name - Default [https://github.com/google/blockly/wiki/Variables variable] representing a [https://github.com/google/blockly/wiki/Lists list].  This should be a single word, preferably short.",
	"Apps.textVariable": "variable name - Default [https://github.com/google/blockly/wiki/Variables variable] representing a [https://github.com/google/blockly/wiki/Text piece of text].  This should be a single word, preferably short.\n{{Identical|Text}}",
	"Code.badXml": "alert - Message shown when the user tries switching from the XML tab after entering XML text that could not be parsed.  This asks whether they wish to abandon the XML they added.  If they select 'OK' (or the translated equivalent), the XML is cleared, and the other tab is shown.  If they select 'Cancel', they remain on the XML tab with the bad XML.\n\nUsed in JavaScript <code>window.confirm()</code>.",
	"Code.badCode": "alert - Message shown if an error occurs while interpreting the user program.  The error description follows.",
	"Code.timeout": "alert - Message shown if the program has run for more than the permitted number of steps.  This exists so that programs with infinite loops do not run forever.",
	"Code.discard": "alert - Message shown after the user clicks on the 'discard all' icon.  Selecting 'OK' (or the translated equivalent) causes all of the blocks to be discarded.  Selecting 'Cancel' prevents blocks from being deleted.\n\nParameters:\n* %1 - number of blocks to be deleted. It is always an integer greater than or equal to 2.",
	"Code.title": "title - Title of this application, indicating that it is for writing arbitrary programs.\n{{Identical|Code}}",
	"Code.blocks": "tab text - Displays and allows editing of the user's program as blocks.\n{{Identical|Blocks}}",
	"Code.trashTooltip": "tooltip - Clicking on this causes the user program to be discarded."
}
